Revit 2026 API
UIDocument.ShowElements Method
Shows one or more elements by zoom to fit.
Overload List
Name | Description
ShowElements(Element) | Shows the element by zoom to fit.
ShowElements(ElementId) | Shows the element by zoom to fit.
ShowElements(ElementSet) | Shows the elements by zoom to fit.
ShowElements(ICollection<ElementId>)
Top
See Also
Reference
UIDocument Class
Autodesk.Revit.UI Namespace